[Killed] ConditionalExpression
src/batch.js:14:12
 const sleep = util.promisify(setTimeout);
 
 exports.processSortedSet = async function (setKey, process, options) {
-	options = options || {};
+	options = false;
 
 	if (typeof process !== 'function') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot create property 'batch' on boolean 'false'

[Killed] LogicalOperator
src/batch.js:14:12
 const sleep = util.promisify(setTimeout);
 
 exports.processSortedSet = async function (setKey, process, options) {
-	options = options || {};
+	options = options && {};
 
 	if (typeof process !== 'function') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/batch.js:16:6
 exports.processSortedSet = async function (setKey, process, options) {
 	options = options || {};
 
-	if (typeof process !== 'function') {
+	if (true) {
 		throw new Error('[[error:process-not-a-function]]');
 	}
killedBy: should correctly compare a password and a hash
statusReason: [[error:process-not-a-function]]

[Killed] EqualityOperator
src/batch.js:16:6
 exports.processSortedSet = async function (setKey, process, options) {
 	options = options || {};
 
-	if (typeof process !== 'function') {
+	if (typeof process === 'function') {
 		throw new Error('[[error:process-not-a-function]]');
 	}
killedBy: should correctly compare a password and a hash
statusReason: [[error:process-not-a-function]]

[Killed] ConditionalExpression
src/batch.js:21:6
 	}
 
 	// Progress bar handling (upgrade scripts)
-	if (options.progress) {
+	if (true) {
 		options.progress.total = await db.sortedSetCard(setKey);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Cannot set properties of undefined (setting 'total')

[Killed] ConditionalExpression
src/batch.js:21:6
 	}
 
 	// Progress bar handling (upgrade scripts)
-	if (options.progress) {
+	if (false) {
 		options.progress.total = await db.sortedSetCard(setKey);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:25:18
 		options.progress.total = await db.sortedSetCard(setKey);
 	}
 
-	options.batch = options.batch || DEFAULT_BATCH_SIZE;
+	options.batch = false;
 	options.reverse = options.reverse || false;
 
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:25:18
 		options.progress.total = await db.sortedSetCard(setKey);
 	}
 
-	options.batch = options.batch || DEFAULT_BATCH_SIZE;
+	options.batch = options.batch && DEFAULT_BATCH_SIZE;
 	options.reverse = options.reverse || false;
 
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/batch.js:26:39
 	}
 
 	options.batch = options.batch || DEFAULT_BATCH_SIZE;
-	options.reverse = options.reverse || false;
+	options.reverse = options.reverse || true;
 
 	// use the fast path if possible
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:26:20
 	}
 
 	options.batch = options.batch || DEFAULT_BATCH_SIZE;
-	options.reverse = options.reverse || false;
+	options.reverse = options.reverse && false;
 
 	// use the fast path if possible
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:29:6
 	options.reverse = options.reverse || false;
 
 	// use the fast path if possible
-	if (db.processSortedSet && typeof options.doneIf !== 'function' && !utils.isNumber(options.alwaysStartAt)) {
+	if (false) {
 		return await db.processSortedSet(setKey, process, options);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:29:6
 	options.reverse = options.reverse || false;
 
 	// use the fast path if possible
-	if (db.processSortedSet && typeof options.doneIf !== 'function' && !utils.isNumber(options.alwaysStartAt)) {
+	if (db.processSortedSet || typeof options.doneIf !== 'function' && !utils.isNumber(options.alwaysStartAt)) {
 		return await db.processSortedSet(setKey, process, options);
 	}
killedBy: should correctly compare a password and a hash
statusReason: db.processSortedSet is not a function

[Killed] ConditionalExpression
src/batch.js:34:19
 	}
 
 	// custom done condition
-	options.doneIf = typeof options.doneIf === 'function' ? options.doneIf : function () {};
+	options.doneIf = false ? options.doneIf : function () {};
 
 	let start = 0;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:34:19
 	}
 
 	// custom done condition
-	options.doneIf = typeof options.doneIf === 'function' ? options.doneIf : function () {};
+	options.doneIf = true ? options.doneIf : function () {};
 
 	let start = 0;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/batch.js:37:13
 	options.doneIf = typeof options.doneIf === 'function' ? options.doneIf : function () {};
 
 	let start = 0;
-	let stop = options.batch - 1;
+	let stop = options.batch + 1;
 
 	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/batch.js:39:40
 	let start = 0;
 	let stop = options.batch - 1;
 
-	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
+	if (process && process.constructor && process.constructor.name === 'AsyncFunction') {
 		process = util.promisify(process);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:39:6
 	let start = 0;
 	let stop = options.batch - 1;
 
-	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
+	if (true) {
 		process = util.promisify(process);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/batch.js:43:60
 		process = util.promisify(process);
 	}
 
-	const method = options.reverse ? 'getSortedSetRevRange' : 'getSortedSetRange';
+	const method = options.reverse ? 'getSortedSetRevRange' : "";
 	const isByScore = (options.min && options.min !== '-inf') || (options.max && options.max !== '+inf');
 	const byScore = isByScore ? 'ByScore' : '';
killedBy: should correctly compare a password and a hash
statusReason: getFn is not a function

[Killed] EqualityOperator
src/batch.js:44:36
 	}
 
 	const method = options.reverse ? 'getSortedSetRevRange' : 'getSortedSetRange';
-	const isByScore = (options.min && options.min !== '-inf') || (options.max && options.max !== '+inf');
+	const isByScore = (options.min && options.min === '-inf') || (options.max && options.max !== '+inf');
 	const byScore = isByScore ? 'ByScore' : '';
 	const withScores = options.withScores ? 'WithScores' : '';
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:44:20
 	}
 
 	const method = options.reverse ? 'getSortedSetRevRange' : 'getSortedSetRange';
-	const isByScore = (options.min && options.min !== '-inf') || (options.max && options.max !== '+inf');
+	const isByScore = options.min && options.min !== '-inf' && options.max && options.max !== '+inf';
 	const byScore = isByScore ? 'ByScore' : '';
 	const withScores = options.withScores ? 'WithScores' : '';
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] StringLiteral
src/batch.js:45:30
 
 	const method = options.reverse ? 'getSortedSetRevRange' : 'getSortedSetRange';
 	const isByScore = (options.min && options.min !== '-inf') || (options.max && options.max !== '+inf');
-	const byScore = isByScore ? 'ByScore' : '';
+	const byScore = isByScore ? "" : '';
 	const withScores = options.withScores ? 'WithScores' : '';
 	let iteration = 1;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] BooleanLiteral
src/batch.js:49:9
 	const withScores = options.withScores ? 'WithScores' : '';
 	let iteration = 1;
 	const getFn = db[`${method}${byScore}${withScores}`];
-	while (true) {
+	while (false) {
 		/* eslint-disable no-await-in-loop */
 		const ids = await getFn(
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/batch.js:54:16
 		const ids = await getFn(
 			setKey,
 			start,
-			isByScore ? stop - start + 1 : stop,
+			isByScore ? stop - start - 1 : stop,
 			options.reverse ? options.max : options.min,
 			options.reverse ? options.min : options.max,
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/batch.js:54:16
 		const ids = await getFn(
 			setKey,
 			start,
-			isByScore ? stop - start + 1 : stop,
+			isByScore ? stop + start + 1 : stop,
 			options.reverse ? options.max : options.min,
 			options.reverse ? options.min : options.max,
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:59:7
 			options.reverse ? options.min : options.max,
 		);
 
-		if (!ids.length || options.doneIf(start, stop, ids)) {
+		if (true) {
 			return;
 		}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Timeout] ConditionalExpression
src/batch.js:59:7
 			options.reverse ? options.min : options.max,
 		);
 
-		if (!ids.length || options.doneIf(start, stop, ids)) {
+		if (false) {
 			return;
 		}

[Killed] EqualityOperator
src/batch.js:62:7
 		if (!ids.length || options.doneIf(start, stop, ids)) {
 			return;
 		}
-		if (iteration > 1 && options.interval) {
+		if (iteration <= 1 && options.interval) {
 			await sleep(options.interval);
 		}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/batch.js:62:7
 		if (!ids.length || options.doneIf(start, stop, ids)) {
 			return;
 		}
-		if (iteration > 1 && options.interval) {
+		if (iteration >= 1 && options.interval) {
 			await sleep(options.interval);
 		}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] AssignmentOperator
src/batch.js:66:3
 			await sleep(options.interval);
 		}
 		await process(ids);
-		iteration += 1;
+		iteration -= 1;
 		start += utils.isNumber(options.alwaysStartAt) ? options.alwaysStartAt : options.batch;
 		stop = start + options.batch - 1;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] AssignmentOperator
src/batch.js:67:3
 		}
 		await process(ids);
 		iteration += 1;
-		start += utils.isNumber(options.alwaysStartAt) ? options.alwaysStartAt : options.batch;
+		start -= utils.isNumber(options.alwaysStartAt) ? options.alwaysStartAt : options.batch;
 		stop = start + options.batch - 1;
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/batch.js:68:10
 		await process(ids);
 		iteration += 1;
 		start += utils.isNumber(options.alwaysStartAt) ? options.alwaysStartAt : options.batch;
-		stop = start + options.batch - 1;
+		stop = start + options.batch + 1;
 	}
 };
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/batch.js:68:10
 		await process(ids);
 		iteration += 1;
 		start += utils.isNumber(options.alwaysStartAt) ? options.alwaysStartAt : options.batch;
-		stop = start + options.batch - 1;
+		stop = start - options.batch - 1;
 	}
 };
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:73:12
 };
 
 exports.processArray = async function (array, process, options) {
-	options = options || {};
+	options = true;
 
 	if (!Array.isArray(array) || !array.length) {
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:73:12
 };
 
 exports.processArray = async function (array, process, options) {
-	options = options || {};
+	options = options && {};
 
 	if (!Array.isArray(array) || !array.length) {
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:75:6
 exports.processArray = async function (array, process, options) {
 	options = options || {};
 
-	if (!Array.isArray(array) || !array.length) {
+	if (true) {
 		return;
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:75:6
 exports.processArray = async function (array, process, options) {
 	options = options || {};
 
-	if (!Array.isArray(array) || !array.length) {
+	if (false) {
 		return;
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:78:6
 	if (!Array.isArray(array) || !array.length) {
 		return;
 	}
-	if (typeof process !== 'function') {
+	if (true) {
 		throw new Error('[[error:process-not-a-function]]');
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/batch.js:78:6
 	if (!Array.isArray(array) || !array.length) {
 		return;
 	}
-	if (typeof process !== 'function') {
+	if (typeof process === 'function') {
 		throw new Error('[[error:process-not-a-function]]');
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/batch.js:82:16
 		throw new Error('[[error:process-not-a-function]]');
 	}
 
-	const batch = options.batch || DEFAULT_BATCH_SIZE;
+	const batch = false;
 	let start = 0;
 	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/batch.js:82:16
 		throw new Error('[[error:process-not-a-function]]');
 	}
 
-	const batch = options.batch || DEFAULT_BATCH_SIZE;
+	const batch = options.batch && DEFAULT_BATCH_SIZE;
 	let start = 0;
 	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/batch.js:84:86
 
 	const batch = options.batch || DEFAULT_BATCH_SIZE;
 	let start = 0;
-	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
-		process = util.promisify(process);
-	}
+	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {}
 	let iteration = 1;
 	while (true) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/batch.js:84:6
 
 	const batch = options.batch || DEFAULT_BATCH_SIZE;
 	let start = 0;
-	if (process && process.constructor && process.constructor.name !== 'AsyncFunction') {
+	if (process && process.constructor || process.constructor.name !== 'AsyncFunction') {
 		process = util.promisify(process);
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/batch.js:88:15
 		process = util.promisify(process);
 	}
 	let iteration = 1;
-	while (true) {
-		const currentBatch = array.slice(start, start + batch);
-
-		if (!currentBatch.length) {
-			return;
-		}
-		if (iteration > 1 && options.interval) {
-			await sleep(options.interval);
-		}
-		await process(currentBatch);
-
-		start += batch;
-		iteration += 1;
-	}
+	while (true) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/batch.js:88:9
 		process = util.promisify(process);
 	}
 	let iteration = 1;
-	while (true) {
+	while (false) {
 		const currentBatch = array.slice(start, start + batch);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/batch.js:89:24
 	}
 	let iteration = 1;
 	while (true) {
-		const currentBatch = array.slice(start, start + batch);
+		const currentBatch = array;
 
 		if (!currentBatch.length) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/batch.js:89:43
 	}
 	let iteration = 1;
 	while (true) {
-		const currentBatch = array.slice(start, start + batch);
+		const currentBatch = array.slice(start, start - batch);
 
 		if (!currentBatch.length) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/batch.js:91:29
 	while (true) {
 		const currentBatch = array.slice(start, start + batch);
 
-		if (!currentBatch.length) {
-			return;
-		}
+		if (!currentBatch.length) {}
 		if (iteration > 1 && options.interval) {
 			await sleep(options.interval);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/batch.js:91:7
 	while (true) {
 		const currentBatch = array.slice(start, start + batch);
 
-		if (!currentBatch.length) {
+		if (false) {
 			return;
 		}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/batch.js:94:42
 		if (!currentBatch.length) {
 			return;
 		}
-		if (iteration > 1 && options.interval) {
-			await sleep(options.interval);
-		}
+		if (iteration > 1 && options.interval) {}
 		await process(currentBatch);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] AssignmentOperator
src/batch.js:99:3
 		}
 		await process(currentBatch);
 
-		start += batch;
+		start -= batch;
 		iteration += 1;
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] AssignmentOperator
src/batch.js:100:3
 		await process(currentBatch);
 
 		start += batch;
-		iteration += 1;
+		iteration -= 1;
 	}
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
