[Killed] BlockStatement
src/password.js:13:50
 	}
 );
 
-exports.hash = async function (rounds, password) {
-	password = crypto.createHash('sha512').update(password).digest('hex');
-	return await pool.exec('hash', [password, rounds]);
-};
+exports.hash = async function (rounds, password) {};
 
 exports.compare = async function (password, hash, shaWrapped) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/password.js:18:63
 	return await pool.exec('hash', [password, rounds]);
 };
 
-exports.compare = async function (password, hash, shaWrapped) {
-	const fakeHash = await getFakeHash();
-
-	if (shaWrapped) {
-		password = crypto.createHash('sha512').update(password).digest('hex');
-	}
-	return await pool.exec('compare', [password, hash || fakeHash]);
-};
+exports.compare = async function (password, hash, shaWrapped) {};
 
 let fakeHashCache;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/password.js:21:18
 exports.compare = async function (password, hash, shaWrapped) {
 	const fakeHash = await getFakeHash();
 
-	if (shaWrapped) {
-		password = crypto.createHash('sha512').update(password).digest('hex');
-	}
+	if (shaWrapped) {}
 	return await pool.exec('compare', [password, hash || fakeHash]);
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/password.js:21:6
 exports.compare = async function (password, hash, shaWrapped) {
 	const fakeHash = await getFakeHash();
 
-	if (shaWrapped) {
+	if (false) {
 		password = crypto.createHash('sha512').update(password).digest('hex');
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/password.js:24:47
 	if (shaWrapped) {
 		password = crypto.createHash('sha512').update(password).digest('hex');
 	}
-	return await pool.exec('compare', [password, hash || fakeHash]);
+	return await pool.exec('compare', [password, false]);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/password.js:24:47
 	if (shaWrapped) {
 		password = crypto.createHash('sha512').update(password).digest('hex');
 	}
-	return await pool.exec('compare', [password, hash || fakeHash]);
+	return await pool.exec('compare', [password, true]);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/password.js:28:30
 };
 
 let fakeHashCache;
-async function getFakeHash() {
-	if (fakeHashCache) {
-		return fakeHashCache;
-	}
-	const length = 18;
-	fakeHashCache = crypto.randomBytes(Math.ceil(length / 2))
-		.toString('hex').slice(0, length);
-	return fakeHashCache;
-}
+async function getFakeHash() {}
 
 require('./promisify')(exports);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/password.js:29:6
 
 let fakeHashCache;
 async function getFakeHash() {
-	if (fakeHashCache) {
+	if (false) {
 		return fakeHashCache;
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/password.js:29:21
 
 let fakeHashCache;
 async function getFakeHash() {
-	if (fakeHashCache) {
-		return fakeHashCache;
-	}
+	if (fakeHashCache) {}
 	const length = 18;
 	fakeHashCache = crypto.randomBytes(Math.ceil(length / 2))
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/password.js:33:18
 		return fakeHashCache;
 	}
 	const length = 18;
-	fakeHashCache = crypto.randomBytes(Math.ceil(length / 2))
-		.toString('hex').slice(0, length);
+	fakeHashCache = crypto.randomBytes(Math.ceil(length / 2)).toString('hex');
 	return fakeHashCache;
 }
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/password.js:33:47
 		return fakeHashCache;
 	}
 	const length = 18;
-	fakeHashCache = crypto.randomBytes(Math.ceil(length / 2))
+	fakeHashCache = crypto.randomBytes(Math.ceil(length * 2))
 		.toString('hex').slice(0, length);
 	return fakeHashCache;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
