[Killed] BlockStatement
src/pagination.js:9:22
 const pagination = module.exports;
 
 pagination.create = function (currentPage, pageCount, queryObj) {
-	if (pageCount <= 1) {
-		return {
-			prev: { page: 1, active: currentPage > 1 },
-			next: { page: 1, active: currentPage < pageCount },
-			first: { page: 1, active: currentPage === 1 },
-			last: { page: 1, active: currentPage === pageCount },
-			rel: [],
-			pages: [],
-			currentPage: 1,
-			pageCount: 1,
-		};
-	}
+	if (pageCount <= 1) {}
 	pageCount = parseInt(pageCount, 10);
 	let pagesToShow = [1, 2, pageCount - 1, pageCount];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:9:6
 const pagination = module.exports;
 
 pagination.create = function (currentPage, pageCount, queryObj) {
-	if (pageCount <= 1) {
+	if (false) {
 		return {
 			prev: { page: 1, active: currentPage > 1 },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:11:29
 pagination.create = function (currentPage, pageCount, queryObj) {
 	if (pageCount <= 1) {
 		return {
-			prev: { page: 1, active: currentPage > 1 },
+			prev: { page: 1, active: true },
 			next: { page: 1, active: currentPage < pageCount },
 			first: { page: 1, active: currentPage === 1 },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:11:29
 pagination.create = function (currentPage, pageCount, queryObj) {
 	if (pageCount <= 1) {
 		return {
-			prev: { page: 1, active: currentPage > 1 },
+			prev: { page: 1, active: false },
 			next: { page: 1, active: currentPage < pageCount },
 			first: { page: 1, active: currentPage === 1 },
killedBy: should correctly compare a password and a hash
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] ConditionalExpression
src/pagination.js:12:29
 	if (pageCount <= 1) {
 		return {
 			prev: { page: 1, active: currentPage > 1 },
-			next: { page: 1, active: currentPage < pageCount },
+			next: { page: 1, active: true },
 			first: { page: 1, active: currentPage === 1 },
 			last: { page: 1, active: currentPage === pageCount },
killedBy: should correctly compare a password and a hash
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] EqualityOperator
src/pagination.js:12:29
 	if (pageCount <= 1) {
 		return {
 			prev: { page: 1, active: currentPage > 1 },
-			next: { page: 1, active: currentPage < pageCount },
+			next: { page: 1, active: currentPage <= pageCount },
 			first: { page: 1, active: currentPage === 1 },
 			last: { page: 1, active: currentPage === pageCount },
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/pagination.js:13:30
 		return {
 			prev: { page: 1, active: currentPage > 1 },
 			next: { page: 1, active: currentPage < pageCount },
-			first: { page: 1, active: currentPage === 1 },
+			first: { page: 1, active: true },
 			last: { page: 1, active: currentPage === pageCount },
 			rel: [],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:13:30
 		return {
 			prev: { page: 1, active: currentPage > 1 },
 			next: { page: 1, active: currentPage < pageCount },
-			first: { page: 1, active: currentPage === 1 },
+			first: { page: 1, active: false },
 			last: { page: 1, active: currentPage === pageCount },
 			rel: [],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:14:29
 			prev: { page: 1, active: currentPage > 1 },
 			next: { page: 1, active: currentPage < pageCount },
 			first: { page: 1, active: currentPage === 1 },
-			last: { page: 1, active: currentPage === pageCount },
+			last: { page: 1, active: currentPage !== pageCount },
 			rel: [],
 			pages: [],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:14:29
 			prev: { page: 1, active: currentPage > 1 },
 			next: { page: 1, active: currentPage < pageCount },
 			first: { page: 1, active: currentPage === 1 },
-			last: { page: 1, active: currentPage === pageCount },
+			last: { page: 1, active: false },
 			rel: [],
 			pages: [],
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:22:27
 		};
 	}
 	pageCount = parseInt(pageCount, 10);
-	let pagesToShow = [1, 2, pageCount - 1, pageCount];
+	let pagesToShow = [1, 2, pageCount + 1, pageCount];
 
 	currentPage = parseInt(currentPage, 10) || 1;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArrayDeclaration
src/pagination.js:22:20
 		};
 	}
 	pageCount = parseInt(pageCount, 10);
-	let pagesToShow = [1, 2, pageCount - 1, pageCount];
+	let pagesToShow = [];
 
 	currentPage = parseInt(currentPage, 10) || 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:24:16
 	pageCount = parseInt(pageCount, 10);
 	let pagesToShow = [1, 2, pageCount - 1, pageCount];
 
-	currentPage = parseInt(currentPage, 10) || 1;
+	currentPage = false;
 	const previous = Math.max(1, currentPage - 1);
 	const next = Math.min(pageCount, currentPage + 1);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] LogicalOperator
src/pagination.js:24:16
 	pageCount = parseInt(pageCount, 10);
 	let pagesToShow = [1, 2, pageCount - 1, pageCount];
 
-	currentPage = parseInt(currentPage, 10) || 1;
+	currentPage = parseInt(currentPage, 10) && 1;
 	const previous = Math.max(1, currentPage - 1);
 	const next = Math.min(pageCount, currentPage + 1);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:25:31
 	let pagesToShow = [1, 2, pageCount - 1, pageCount];
 
 	currentPage = parseInt(currentPage, 10) || 1;
-	const previous = Math.max(1, currentPage - 1);
+	const previous = Math.max(1, currentPage + 1);
 	const next = Math.min(pageCount, currentPage + 1);
 
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] MethodExpression
src/pagination.js:25:19
 	let pagesToShow = [1, 2, pageCount - 1, pageCount];
 
 	currentPage = parseInt(currentPage, 10) || 1;
-	const previous = Math.max(1, currentPage - 1);
+	const previous = Math.min(1, currentPage - 1);
 	const next = Math.min(pageCount, currentPage + 1);
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:26:35
 
 	currentPage = parseInt(currentPage, 10) || 1;
 	const previous = Math.max(1, currentPage - 1);
-	const next = Math.min(pageCount, currentPage + 1);
+	const next = Math.min(pageCount, currentPage - 1);
 
 	let startPage = Math.max(1, currentPage - 2);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/pagination.js:26:15
 
 	currentPage = parseInt(currentPage, 10) || 1;
 	const previous = Math.max(1, currentPage - 1);
-	const next = Math.min(pageCount, currentPage + 1);
+	const next = Math.max(pageCount, currentPage + 1);
 
 	let startPage = Math.max(1, currentPage - 2);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] MethodExpression
src/pagination.js:28:18
 	const previous = Math.max(1, currentPage - 1);
 	const next = Math.min(pageCount, currentPage + 1);
 
-	let startPage = Math.max(1, currentPage - 2);
+	let startPage = Math.min(1, currentPage - 2);
 	if (startPage > pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:28:30
 	const previous = Math.max(1, currentPage - 1);
 	const next = Math.min(pageCount, currentPage + 1);
 
-	let startPage = Math.max(1, currentPage - 2);
+	let startPage = Math.max(1, currentPage + 2);
 	if (startPage > pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:29:33
 	const next = Math.min(pageCount, currentPage + 1);
 
 	let startPage = Math.max(1, currentPage - 2);
-	if (startPage > pageCount - 5) {
-		startPage -= 2 - (pageCount - currentPage);
-	}
+	if (startPage > pageCount - 5) {}
 	for (let i = 0; i < 5; i += 1) {
 		pagesToShow.push(startPage + i);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:29:6
 	const next = Math.min(pageCount, currentPage + 1);
 
 	let startPage = Math.max(1, currentPage - 2);
-	if (startPage > pageCount - 5) {
+	if (startPage >= pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
 	}
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] AssignmentOperator
src/pagination.js:30:3
 
 	let startPage = Math.max(1, currentPage - 2);
 	if (startPage > pageCount - 5) {
-		startPage -= 2 - (pageCount - currentPage);
+		startPage += 2 - (pageCount - currentPage);
 	}
 	for (let i = 0; i < 5; i += 1) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:30:21
 
 	let startPage = Math.max(1, currentPage - 2);
 	if (startPage > pageCount - 5) {
-		startPage -= 2 - (pageCount - currentPage);
+		startPage -= 2 - (pageCount + currentPage);
 	}
 	for (let i = 0; i < 5; i += 1) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:32:18
 	if (startPage > pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
 	}
-	for (let i = 0; i < 5; i += 1) {
+	for (let i = 0; i >= 5; i += 1) {
 		pagesToShow.push(startPage + i);
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:32:33
 	if (startPage > pageCount - 5) {
 		startPage -= 2 - (pageCount - currentPage);
 	}
-	for (let i = 0; i < 5; i += 1) {
-		pagesToShow.push(startPage + i);
-	}
+	for (let i = 0; i < 5; i += 1) {}
 
 	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page <= pageCount).sort((a, b) => a - b);
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ArithmeticOperator
src/pagination.js:33:20
 		startPage -= 2 - (pageCount - currentPage);
 	}
 	for (let i = 0; i < 5; i += 1) {
-		pagesToShow.push(startPage + i);
+		pagesToShow.push(startPage - i);
 	}
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:36:63
 		pagesToShow.push(startPage + i);
 	}
 
-	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page <= pageCount).sort((a, b) => a - b);
+	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && true).sort((a, b) => a - b);
 
 	queryObj = { ...(queryObj || {}) };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:36:63
 		pagesToShow.push(startPage + i);
 	}
 
-	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page <= pageCount).sort((a, b) => a - b);
+	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page > pageCount).sort((a, b) => a - b);
 
 	queryObj = { ...(queryObj || {}) };
killedBy: should correctly compare a password and a hash
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] ConditionalExpression
src/pagination.js:38:19
 
 	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page <= pageCount).sort((a, b) => a - b);
 
-	queryObj = { ...(queryObj || {}) };
+	queryObj = { ...(true) };
 
 	delete queryObj._;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] LogicalOperator
src/pagination.js:38:19
 
 	pagesToShow = _.uniq(pagesToShow).filter(page => page > 0 && page <= pageCount).sort((a, b) => a - b);
 
-	queryObj = { ...(queryObj || {}) };
+	queryObj = { ...(queryObj && {}) };
 
 	delete queryObj._;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:42:42
 
 	delete queryObj._;
 
-	const pages = pagesToShow.map((page) => {
-		queryObj.page = page;
-		return { page: page, active: page === currentPage, qs: qs.stringify(queryObj) };
-	});
+	const pages = pagesToShow.map((page) => {});
 
 	for (let i = pages.length - 1; i > 0; i -= 1) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:44:32
 
 	const pages = pagesToShow.map((page) => {
 		queryObj.page = page;
-		return { page: page, active: page === currentPage, qs: qs.stringify(queryObj) };
+		return { page: page, active: page !== currentPage, qs: qs.stringify(queryObj) };
 	});
 
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/pagination.js:44:32
 
 	const pages = pagesToShow.map((page) => {
 		queryObj.page = page;
-		return { page: page, active: page === currentPage, qs: qs.stringify(queryObj) };
+		return { page: page, active: false, qs: qs.stringify(queryObj) };
 	});
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:47:33
 		return { page: page, active: page === currentPage, qs: qs.stringify(queryObj) };
 	});
 
-	for (let i = pages.length - 1; i > 0; i -= 1) {
+	for (let i = pages.length - 1; i <= 0; i -= 1) {
 		const prevPage = pages[i].page - 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:47:48
 		return { page: page, active: page === currentPage, qs: qs.stringify(queryObj) };
 	});
 
-	for (let i = pages.length - 1; i > 0; i -= 1) {
-		const prevPage = pages[i].page - 1;
-		if (pages[i].page - 2 === pages[i - 1].page) {
-			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
-		} else if (prevPage !== pages[i - 1].page) {
-			pages.splice(i, 0, { separator: true });
-		}
-	}
+	for (let i = pages.length - 1; i > 0; i -= 1) {}
 
 	const data = { rel: [], pages: pages, currentPage: currentPage, pageCount: pageCount };
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ArithmeticOperator
src/pagination.js:48:20
 	});
 
 	for (let i = pages.length - 1; i > 0; i -= 1) {
-		const prevPage = pages[i].page - 1;
+		const prevPage = pages[i].page + 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:49:48
 
 	for (let i = pages.length - 1; i > 0; i -= 1) {
 		const prevPage = pages[i].page - 1;
-		if (pages[i].page - 2 === pages[i - 1].page) {
-			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
-		} else if (prevPage !== pages[i - 1].page) {
+		if (pages[i].page - 2 === pages[i - 1].page) {} else if (prevPage !== pages[i - 1].page) {
 			pages.splice(i, 0, { separator: true });
 		}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:49:7
 
 	for (let i = pages.length - 1; i > 0; i -= 1) {
 		const prevPage = pages[i].page - 1;
-		if (pages[i].page - 2 === pages[i - 1].page) {
+		if (true) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
 		} else if (prevPage !== pages[i - 1].page) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BooleanLiteral
src/pagination.js:50:49
 	for (let i = pages.length - 1; i > 0; i -= 1) {
 		const prevPage = pages[i].page - 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
-			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
+			pages.splice(i, 0, { page: prevPage, active: true, qs: qs.stringify({ ...queryObj, page: prevPage }) });
 		} else if (prevPage !== pages[i - 1].page) {
 			pages.splice(i, 0, { separator: true });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/pagination.js:50:73
 	for (let i = pages.length - 1; i > 0; i -= 1) {
 		const prevPage = pages[i].page - 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
-			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
+			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({}) });
 		} else if (prevPage !== pages[i - 1].page) {
 			pages.splice(i, 0, { separator: true });
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:51:14
 		const prevPage = pages[i].page - 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
-		} else if (prevPage !== pages[i - 1].page) {
+		} else if (false) {
 			pages.splice(i, 0, { separator: true });
 		}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:51:14
 		const prevPage = pages[i].page - 1;
 		if (pages[i].page - 2 === pages[i - 1].page) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
-		} else if (prevPage !== pages[i - 1].page) {
+		} else if (prevPage === pages[i - 1].page) {
 			pages.splice(i, 0, { separator: true });
 		}
killedBy: should correctly compare a password and a hash
statusReason: ENOTEMPTY: directory not empty, rmdir 'test/uploads'

[Killed] BooleanLiteral
src/pagination.js:52:36
 		if (pages[i].page - 2 === pages[i - 1].page) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
 		} else if (prevPage !== pages[i - 1].page) {
-			pages.splice(i, 0, { separator: true });
+			pages.splice(i, 0, { separator: false });
 		}
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/pagination.js:52:23
 		if (pages[i].page - 2 === pages[i - 1].page) {
 			pages.splice(i, 0, { page: prevPage, active: false, qs: qs.stringify({ ...queryObj, page: prevPage }) });
 		} else if (prevPage !== pages[i - 1].page) {
-			pages.splice(i, 0, { separator: true });
+			pages.splice(i, 0, {});
 		}
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:58:40
 
 	const data = { rel: [], pages: pages, currentPage: currentPage, pageCount: pageCount };
 	queryObj.page = previous;
-	data.prev = { page: previous, active: currentPage > 1, qs: qs.stringify(queryObj) };
+	data.prev = { page: previous, active: currentPage >= 1, qs: qs.stringify(queryObj) };
 	queryObj.page = next;
 	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:58:40
 
 	const data = { rel: [], pages: pages, currentPage: currentPage, pageCount: pageCount };
 	queryObj.page = previous;
-	data.prev = { page: previous, active: currentPage > 1, qs: qs.stringify(queryObj) };
+	data.prev = { page: previous, active: false, qs: qs.stringify(queryObj) };
 	queryObj.page = next;
 	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:60:36
 	queryObj.page = previous;
 	data.prev = { page: previous, active: currentPage > 1, qs: qs.stringify(queryObj) };
 	queryObj.page = next;
-	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
+	data.next = { page: next, active: false, qs: qs.stringify(queryObj) };
 
 	queryObj.page = 1;
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/pagination.js:60:36
 	queryObj.page = previous;
 	data.prev = { page: previous, active: currentPage > 1, qs: qs.stringify(queryObj) };
 	queryObj.page = next;
-	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
+	data.next = { page: next, active: currentPage <= pageCount, qs: qs.stringify(queryObj) };
 
 	queryObj.page = 1;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:63:34
 	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
 
 	queryObj.page = 1;
-	data.first = { page: 1, active: currentPage === 1, qs: qs.stringify(queryObj) };
+	data.first = { page: 1, active: currentPage !== 1, qs: qs.stringify(queryObj) };
 	queryObj.page = pageCount;
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ConditionalExpression
src/pagination.js:63:34
 	data.next = { page: next, active: currentPage < pageCount, qs: qs.stringify(queryObj) };
 
 	queryObj.page = 1;
-	data.first = { page: 1, active: currentPage === 1, qs: qs.stringify(queryObj) };
+	data.first = { page: 1, active: true, qs: qs.stringify(queryObj) };
 	queryObj.page = pageCount;
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:65:41
 	queryObj.page = 1;
 	data.first = { page: 1, active: currentPage === 1, qs: qs.stringify(queryObj) };
 	queryObj.page = pageCount;
-	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
+	data.last = { page: pageCount, active: false, qs: qs.stringify(queryObj) };
 
 	if (currentPage < pageCount) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:65:41
 	queryObj.page = 1;
 	data.first = { page: 1, active: currentPage === 1, qs: qs.stringify(queryObj) };
 	queryObj.page = pageCount;
-	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
+	data.last = { page: pageCount, active: true, qs: qs.stringify(queryObj) };
 
 	if (currentPage < pageCount) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] EqualityOperator
src/pagination.js:67:6
 	queryObj.page = pageCount;
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
 
-	if (currentPage < pageCount) {
+	if (currentPage <= pageCount) {
 		data.rel.push({
 			rel: 'next',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/pagination.js:67:6
 	queryObj.page = pageCount;
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
 
-	if (currentPage < pageCount) {
+	if (false) {
 		data.rel.push({
 			rel: 'next',
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] ObjectLiteral
src/pagination.js:68:17
 	data.last = { page: pageCount, active: currentPage === pageCount, qs: qs.stringify(queryObj) };
 
 	if (currentPage < pageCount) {
-		data.rel.push({
-			rel: 'next',
-			href: `?${qs.stringify({ ...queryObj, page: next })}`,
-		});
+		data.rel.push({});
 	}
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/pagination.js:70:27
 	if (currentPage < pageCount) {
 		data.rel.push({
 			rel: 'next',
-			href: `?${qs.stringify({ ...queryObj, page: next })}`,
+			href: `?${qs.stringify({})}`,
 		});
 	}
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/pagination.js:74:23
 		});
 	}
 
-	if (currentPage > 1) {
-		data.rel.push({
-			rel: 'prev',
-			href: `?${qs.stringify({ ...queryObj, page: previous })}`,
-		});
-	}
+	if (currentPage > 1) {}
 	return data;
 };
killedBy: should correctly compare a password and a hash
statusReason: Listen method has been called more than once without closing.

[Killed] EqualityOperator
src/pagination.js:74:6
 		});
 	}
 
-	if (currentPage > 1) {
+	if (currentPage >= 1) {
 		data.rel.push({
 			rel: 'prev',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/pagination.js:75:17
 	}
 
 	if (currentPage > 1) {
-		data.rel.push({
-			rel: 'prev',
-			href: `?${qs.stringify({ ...queryObj, page: previous })}`,
-		});
+		data.rel.push({});
 	}
 	return data;
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/pagination.js:76:9
 
 	if (currentPage > 1) {
 		data.rel.push({
-			rel: 'prev',
+			rel: "",
 			href: `?${qs.stringify({ ...queryObj, page: previous })}`,
 		});
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
